### Date - 27th Feb, 2025

# 1. Loading Data

In [4]:
import pandas as pd

In [5]:
data = {
    'Name': ['Rajesh','Meetu', 'Lamha','Tanishqua', 'Soham'],
    'Age': [56, 49, 25, 21, 21],
    'Gender': ['Male', 'Female', 'Female', 'Female', 'Male'],
    'City': ['Ahmedabad', 'Ahmedabad', 'Pune', 'Ahmedabad', 'Gandhinagar'],
    'Hobby': ['Driving', 'Cooking', 'Dancing', 'Sleeping', 'Gaming']
}

In [155]:
df = pd.DataFrame(data)

## Viewing Data

In [11]:
df

        Name  Age  Gender         City     Hobby
0     Rajesh   56    Male    Ahmedabad   Driving
1      Meetu   49  Female    Ahmedabad   Cooking
2      Lamha   25  Female         Pune   Dancing
3  Tanishqua   21  Female    Ahmedabad  Sleeping
4      Soham   21    Male  Gandhinagar    Gaming

In [12]:
# df.head() -> Top 5 rows
df.head(2)

     Name  Age  Gender       City    Hobby
0  Rajesh   56    Male  Ahmedabad  Driving
1   Meetu   49  Female  Ahmedabad  Cooking

In [13]:
# df.tail() -> Bottom 5 rows
df.tail(2)

        Name  Age  Gender         City     Hobby
3  Tanishqua   21  Female    Ahmedabad  Sleeping
4      Soham   21    Male  Gandhinagar    Gaming

# 2. DataFrames and Series
### Selecting Rows and Columns
##### By position use iloc method 
##### By Label use loc method
##### For whole columns use df['columnName']

In [131]:
df.iloc[2] # Output is series

Name        lamha
Age            25
Gender     Female
City         Pune
Hobby     Dancing
Name: 2, dtype: object

In [38]:
type(df.iloc[2]) # Output is series

pandas.core.series.Series

In [39]:
df.iloc[[3,4]] # For multiple rows

        Name  Age  Gender         City     Hobby
3  Tanishqua   21  Female    Ahmedabad  Sleeping
4      Soham   21    Male  Gandhinagar    Gaming

In [40]:
type(df.iloc[[3,4]]) # Output is Dataframe

pandas.core.frame.DataFrame

In [41]:
#df.iloc[3, 'Hobby'] -> Gives error because column cannot be accessed by name rather position
df.iloc[3,4]

'Sleeping'

In [42]:
df.iloc[[3,4], [2,3,4]] # For multiple coulumns of multiple rows

   Gender         City     Hobby
3  Female    Ahmedabad  Sleeping
4    Male  Gandhinagar    Gaming

In [47]:
df.loc[[2,3,4], ['Name', 'Age']] # Accessing columns by name

        Name  Age
2      Lamha   25
3  Tanishqua   21
4      Soham   21

In [52]:
df['Name']

0       Rajesh
1        Meetu
2        Lamha
3    Tanishqua
4        Soham
Name: Name, dtype: object

# 3. Indexing

In [55]:
df.set_index('Name', inplace=True)

In [56]:
df

           Age  Gender         City     Hobby
Name
Rajesh      56    Male    Ahmedabad   Driving
Meetu       49  Female    Ahmedabad   Cooking
Lamha       25  Female         Pune   Dancing
Tanishqua   21  Female    Ahmedabad  Sleeping
Soham       21    Male  Gandhinagar    Gaming

In [58]:
df.loc['Lamha'] # Can access by index value

Age            25
Gender     Female
City         Pune
Hobby     Dancing
Name: Lamha, dtype: object

In [60]:
df.iloc[2] # Can access by index position

Age            25
Gender     Female
City         Pune
Hobby     Dancing
Name: Lamha, dtype: object

In [61]:
df.sort_index()

           Age  Gender         City     Hobby
Name
Lamha       25  Female         Pune   Dancing
Meetu       49  Female    Ahmedabad   Cooking
Rajesh      56    Male    Ahmedabad   Driving
Soham       21    Male  Gandhinagar    Gaming
Tanishqua   21  Female    Ahmedabad  Sleeping

In [73]:
df.reset_index(inplace=True)

# 4. Filtering Data
### To get whole row use df[Filter]
### To get specific columns use df.loc[Filter, columnNames]

In [75]:
young = df['Age'] < 30

In [76]:
df[young]

        Name  Age  Gender         City     Hobby
2      Lamha   25  Female         Pune   Dancing
3  Tanishqua   21  Female    Ahmedabad  Sleeping
4      Soham   21    Male  Gandhinagar    Gaming

In [77]:
male = df['Gender'] == 'Male'

In [89]:
df.loc[male, ['Name', 'Gender']]

     Name Gender
0  Rajesh   Male
4   Soham   Male

In [91]:
old_female = (df['Age'] > 30) & (df['Gender'] == 'Female')

In [92]:
df[old_female]

    Name  Age  Gender       City    Hobby
1  Meetu   49  Female  Ahmedabad  Cooking

# 5. Updating Rows and Columns

In [104]:
## Renaming Columns
df.columns

Index(['Name', 'Age', 'Gender', 'City', 'Hobby'], dtype='object')

In [105]:
df.columns = ['First Name', 'Age', 'Gender', 'City', 'Hobby']

In [106]:
df.columns = [x.upper() for x in df.columns]
df

  FIRST NAME  AGE  GENDER         CITY     HOBBY
0     Rajesh   56    Male    Ahmedabad   Driving
1      Meetu   49  Female    Ahmedabad   Cooking
2      Lamha   25  Female         Pune   Dancing
3  Tanishqua   21  Female    Ahmedabad  Sleeping
4      Soham   21    Male  Gandhinagar    Gaming

In [107]:
df.columns = df.columns.str.replace(' ','_')
df

  FIRST_NAME  AGE  GENDER         CITY     HOBBY
0     Rajesh   56    Male    Ahmedabad   Driving
1      Meetu   49  Female    Ahmedabad   Cooking
2      Lamha   25  Female         Pune   Dancing
3  Tanishqua   21  Female    Ahmedabad  Sleeping
4      Soham   21    Male  Gandhinagar    Gaming

In [111]:
### Reversing the renaming
df.columns = [x.capitalize() for x in df.columns]
df.rename(columns={'First_name': 'Name'}, inplace=True)
df

        Name  Age  Gender         City     Hobby
0     Rajesh   56    Male    Ahmedabad   Driving
1      Meetu   49  Female    Ahmedabad   Cooking
2      Lamha   25  Female         Pune   Dancing
3  Tanishqua   21  Female    Ahmedabad  Sleeping
4      Soham   21    Male  Gandhinagar    Gaming

In [114]:
## Updating the Data in rows
df.loc[2] = ['Lamha', 25, 'Female', 'Ahmedabad', 'Dancing']
df.loc[2]

Name          Lamha
Age              25
Gender       Female
City      Ahmedabad
Hobby       Dancing
Name: 2, dtype: object

In [119]:
df.loc[2, 'City'] = 'Pune'
df.loc[3, ['Age', 'Hobby']] = [28, 'Coding']
df

        Name  Age  Gender         City    Hobby
0     Rajesh   56    Male    Ahmedabad  Driving
1      Meetu   49  Female    Ahmedabad  Cooking
2      Lamha   25  Female         Pune  Dancing
3  Tanishqua   28  Female    Ahmedabad   Coding
4      Soham   21    Male  Gandhinagar   Gaming

In [120]:
df.at[3, 'Age'] = 21
df

        Name  Age  Gender         City    Hobby
0     Rajesh   56    Male    Ahmedabad  Driving
1      Meetu   49  Female    Ahmedabad  Cooking
2      Lamha   25  Female         Pune  Dancing
3  Tanishqua   21  Female    Ahmedabad   Coding
4      Soham   21    Male  Gandhinagar   Gaming

In [122]:
df['Name'] = df['Name'].str.upper()
df

        Name  Age  Gender         City    Hobby
0     RAJESH   56    Male    Ahmedabad  Driving
1      MEETU   49  Female    Ahmedabad  Cooking
2      LAMHA   25  Female         Pune  Dancing
3  TANISHQUA   21  Female    Ahmedabad   Coding
4      SOHAM   21    Male  Gandhinagar   Gaming

#### Apply -> For Series,
#### Map -> ,
#### Applymap -> For DataFrame,
#### Replace

In [125]:
df['Name'].apply(len)

0    6
1    5
2    5
3    9
4    5
Name: Name, dtype: int64

In [129]:
def update_name(name):
    return name.lower()

In [130]:
df['Name'] = df['Name'].apply(update_name)
df

        Name  Age  Gender         City    Hobby
0     rajesh   56    Male    Ahmedabad  Driving
1      meetu   49  Female    Ahmedabad  Cooking
2      lamha   25  Female         Pune  Dancing
3  tanishqua   21  Female    Ahmedabad   Coding
4      soham   21    Male  Gandhinagar   Gaming

In [137]:
df['Name'] = df['Name'].apply(lambda x:x.capitalize())
df

        Name  Age  Gender         City    Hobby
0     Rajesh   56    Male    Ahmedabad  Driving
1      Meetu   49  Female    Ahmedabad  Cooking
2      Lamha   25  Female         Pune  Dancing
3  Tanishqua   21  Female    Ahmedabad   Coding
4      Soham   21    Male  Gandhinagar   Gaming

In [139]:
df.apply(len)

Name      5
Age       5
Gender    5
City      5
Hobby     5
dtype: int64

In [140]:
df.apply(pd.Series.min)

Name          Lamha
Age              21
Gender       Female
City      Ahmedabad
Hobby        Coding
dtype: object

In [143]:
df[['Name','City', 'Hobby']].applymap(len)

   Name  City  Hobby
0     6     9      7
1     5     9      7
2     5     4      7
3     9     9      6
4     5    11      6

In [146]:
df['Name'].map({'Rajesh': 'Raj', 'Tanishqua': 'Tani'})
# For values not in dict it gives NaN

0     Raj
1     NaN
2     NaN
3    Tani
4     NaN
Name: Name, dtype: object

In [147]:
df['Name'].replace({'Rajesh': 'Raj', 'Tanishqua': 'Tani'})
# For values not in dict it keeps the previous value

0      Raj
1    Meetu
2    Lamha
3     Tani
4    Soham
Name: Name, dtype: object

# 6. Add/Remove Rows and Columns

In [156]:
surnames = ['Bansal', 'Bansal', 'Bansal', 'Bansal', 'Dave']
df['Surname'] = surnames
df

        Name  Age  Gender         City     Hobby Surname
0     Rajesh   56    Male    Ahmedabad   Driving  Bansal
1      Meetu   49  Female    Ahmedabad   Cooking  Bansal
2      Lamha   25  Female         Pune   Dancing  Bansal
3  Tanishqua   21  Female    Ahmedabad  Sleeping  Bansal
4      Soham   21    Male  Gandhinagar    Gaming    Dave

In [157]:
df['Full_name'] = df['Name'] + ' ' + df['Surname']

In [158]:
df.drop(columns=['Name', 'Surname'], inplace=True)
df

   Age  Gender         City     Hobby         Full_name
0   56    Male    Ahmedabad   Driving     Rajesh Bansal
1   49  Female    Ahmedabad   Cooking      Meetu Bansal
2   25  Female         Pune   Dancing      Lamha Bansal
3   21  Female    Ahmedabad  Sleeping  Tanishqua Bansal
4   21    Male  Gandhinagar    Gaming        Soham Dave

In [161]:
# df['Full_name'].str.split(' ') -> Make list after splitting
full_names = df['Full_name'].str.split(' ', expand=True) # Make columns after splitting

In [179]:
df[['Name', 'Surname']] = full_names
df

   Age  Gender         City     Hobby         Full_name       Name Surname
0   56    Male    Ahmedabad   Driving     Rajesh Bansal     Rajesh  Bansal
1   49  Female    Ahmedabad   Cooking      Meetu Bansal      Meetu  Bansal
2   25  Female         Pune   Dancing      Lamha Bansal      Lamha  Bansal
3   21  Female    Ahmedabad  Sleeping  Tanishqua Bansal  Tanishqua  Bansal
4   21    Male  Gandhinagar    Gaming        Soham Dave      Soham    Dave

In [182]:
# df.append({'Name': 'Yatri'}) -> Gives no attribute error so use _append instead
# df._append({'Name': 'Yatri'}) -> Gives TypeError
df = df._append({'Name': 'Yatri','Surname': 'Dave', 'Age': 24, 'Gender': 'Female', 'City': 'Gandhinagar', 'Hobby': 'Mandala', 'Full_name': 'Yatri Dave'}, ignore_index=True)

In [183]:
data2 = {
    'Name': ['Manish','Rajeshwari'],
    'Surname': ['Dave', 'Dave'],
    'Age': [52, 50],
    'Gender': ['Male', 'Female'],
    'City': ['Gandhinagar', 'Gandhinagar'],
    'Hobby': ['Driving', 'Cooking'],
    'Full_name': ['Manish Dave', 'Rajeshwari Dave']
}

In [184]:
df2 = pd.DataFrame(data2)

In [194]:
df = df._append(df2, ignore_index=True, sort=False)
df

   Age  Gender         City     Hobby         Full_name        Name Surname
0   56    Male    Ahmedabad   Driving     Rajesh Bansal      Rajesh  Bansal
1   49  Female    Ahmedabad   Cooking      Meetu Bansal       Meetu  Bansal
2   25  Female         Pune   Dancing      Lamha Bansal       Lamha  Bansal
3   21  Female    Ahmedabad  Sleeping  Tanishqua Bansal   Tanishqua  Bansal
4   21    Male  Gandhinagar    Gaming        Soham Dave       Soham    Dave
5   24  Female  Gandhinagar   Mandala        Yatri Dave       Yatri    Dave
6   52    Male  Gandhinagar   Driving       Manish Dave      Manish    Dave
7   50  Female  Gandhinagar   Cooking   Rajeshwari Dave  Rajeshwari    Dave

In [196]:
df.drop(index=7) # Create as view

   Age  Gender         City     Hobby         Full_name       Name Surname
0   56    Male    Ahmedabad   Driving     Rajesh Bansal     Rajesh  Bansal
1   49  Female    Ahmedabad   Cooking      Meetu Bansal      Meetu  Bansal
2   25  Female         Pune   Dancing      Lamha Bansal      Lamha  Bansal
3   21  Female    Ahmedabad  Sleeping  Tanishqua Bansal  Tanishqua  Bansal
4   21    Male  Gandhinagar    Gaming        Soham Dave      Soham    Dave
5   24  Female  Gandhinagar   Mandala        Yatri Dave      Yatri    Dave
6   52    Male  Gandhinagar   Driving       Manish Dave     Manish    Dave

In [197]:
bansals = df['Surname'] == 'Bansal'
df.drop(index=df[bansals].index)

   Age  Gender         City    Hobby        Full_name        Name Surname
4   21    Male  Gandhinagar   Gaming       Soham Dave       Soham    Dave
5   24  Female  Gandhinagar  Mandala       Yatri Dave       Yatri    Dave
6   52    Male  Gandhinagar  Driving      Manish Dave      Manish    Dave
7   50  Female  Gandhinagar  Cooking  Rajeshwari Dave  Rajeshwari    Dave

# 7. Sort Data

In [200]:
df.sort_values(by='Name', ascending=False)

   Age  Gender         City     Hobby         Full_name        Name Surname
5   24  Female  Gandhinagar   Mandala        Yatri Dave       Yatri    Dave
3   21  Female    Ahmedabad  Sleeping  Tanishqua Bansal   Tanishqua  Bansal
4   21    Male  Gandhinagar    Gaming        Soham Dave       Soham    Dave
7   50  Female  Gandhinagar   Cooking   Rajeshwari Dave  Rajeshwari    Dave
0   56    Male    Ahmedabad   Driving     Rajesh Bansal      Rajesh  Bansal
1   49  Female    Ahmedabad   Cooking      Meetu Bansal       Meetu  Bansal
6   52    Male  Gandhinagar   Driving       Manish Dave      Manish    Dave
2   25  Female         Pune   Dancing      Lamha Bansal       Lamha  Bansal

In [202]:
df.sort_values(by=['Hobby','Name'], ascending=[False, True], inplace=True)
df

   Age  Gender         City     Hobby         Full_name        Name Surname
3   21  Female    Ahmedabad  Sleeping  Tanishqua Bansal   Tanishqua  Bansal
5   24  Female  Gandhinagar   Mandala        Yatri Dave       Yatri    Dave
4   21    Male  Gandhinagar    Gaming        Soham Dave       Soham    Dave
6   52    Male  Gandhinagar   Driving       Manish Dave      Manish    Dave
0   56    Male    Ahmedabad   Driving     Rajesh Bansal      Rajesh  Bansal
2   25  Female         Pune   Dancing      Lamha Bansal       Lamha  Bansal
1   49  Female    Ahmedabad   Cooking      Meetu Bansal       Meetu  Bansal
7   50  Female  Gandhinagar   Cooking   Rajeshwari Dave  Rajeshwari    Dave

In [210]:
df = df.sort_index()

In [211]:
df.nlargest(2, 'Age')

   Age Gender         City    Hobby      Full_name    Name Surname  Salary
0   56   Male    Ahmedabad  Driving  Rajesh Bansal  Rajesh  Bansal  570000
6   52   Male  Gandhinagar  Driving    Manish Dave  Manish    Dave  560000

In [212]:
df.nsmallest(2, 'Age')

,Age,Gender,City,Hobby,Full_name,Name,Surname,Salary
3,21,Female,Ahmedabad,Sleeping,Tanishqua Bansal,Tanishqua,Bansal,830000
4,21,Male,Gandhinagar,Gaming,Soham Dave,Soham,Dave,650000

# 8. Grouping and Aggregating

In [213]:
df['Salary'] = [830000, 740000, 650000, 560000, 570000, 680000, 790000, 810000]
df

,Age,Gender,City,Hobby,Full_name,Name,Surname,Salary
0,56,Male,Ahmedabad,Driving,Rajesh Bansal,Rajesh,Bansal,830000
1,49,Female,Ahmedabad,Cooking,Meetu Bansal,Meetu,Bansal,740000
2,25,Female,Pune,Dancing,Lamha Bansal,Lamha,Bansal,650000
3,21,Female,Ahmedabad,Sleeping,Tanishqua Bansal,Tanishqua,Bansal,560000
4,21,Male,Gandhinagar,Gaming,Soham Dave,Soham,Dave,570000
5,24,Female,Gandhinagar,Mandala,Yatri Dave,Yatri,Dave,680000
6,52,Male,Gandhinagar,Driving,Manish Dave,Manish,Dave,790000
7,50,Female,Gandhinagar,Cooking,Rajeshwari Dave,Rajeshwari,Dave,810000

In [214]:
df['Salary'].median()

710000.0

In [217]:
df.describe()

             Age         Salary
count   8.000000       8.000000
mean   37.250000  703750.000000
std    15.691217  105551.273932
min    21.000000  560000.000000
25%    23.250000  630000.000000
50%    37.000000  710000.000000
75%    50.500000  795000.000000
max    56.000000  830000.000000

In [219]:
df['Surname'].count()

8

In [221]:
df['City'].value_counts()

City
Gandhinagar    4
Ahmedabad      3
Pune           1
Name: count, dtype: int64

In [222]:
families = df.groupby('Surname')

In [225]:
families['Salary'].mean()

Surname
Bansal    695000.0
Dave      712500.0
Name: Salary, dtype: float64

In [226]:
families['Salary'].agg(['mean', 'median', 'count'])

             mean    median  count
Surname
Bansal   695000.0  695000.0      4
Dave     712500.0  735000.0      4

In [227]:
# For more details of grouping please refer -> Stackoverflow_Survey.ipynb

# 9. Cleaning Data

In [228]:
import numpy as np

In [236]:
missing_data = {
    'Name': ['Rajesh','Meetu', 'NA','Tanishqua', 'Soham'],
    'Age': [56, 49, 24, 21, 21],
    'Gender': ['Male', 'Female', 'NA', 'Female', 'Missing'],
    'City': ['Ahmedabad', 'Missing', 'Missing', 'Ahmedabad', np.nan],
    'Hobby': ['Driving', None, 'Dancing', None, 'Gaming']
}

In [237]:
missing_df = pd.DataFrame(missing_data)
missing_df

        Name  Age   Gender       City    Hobby
0     Rajesh   56     Male  Ahmedabad  Driving
1      Meetu   49   Female    Missing     None
2         NA   24       NA    Missing  Dancing
3  Tanishqua   21   Female  Ahmedabad     None
4      Soham   21  Missing        NaN   Gaming

In [238]:
missing_df.dropna()

     Name  Age Gender       City    Hobby
0  Rajesh   56   Male  Ahmedabad  Driving
2      NA   24     NA    Missing  Dancing

In [239]:
missing_df.dropna(axis='index', how='any')

     Name  Age Gender       City    Hobby
0  Rajesh   56   Male  Ahmedabad  Driving
2      NA   24     NA    Missing  Dancing

In [240]:
# Resume from here tomorrow -> https://www.youtube.com/watch?v=KdmPHEnPJPs&list=PL-osiE80TeTsWmV9i9c58mdDCSskIFdDS&index=9